; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-5packages-1042seed

(define (problem transport-three-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-5packages-1042seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 363,56 -> 255,149
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 15)
  ; 255,149 -> 363,56
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 15)
  ; 501,401 -> 255,149
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 36)
  ; 255,149 -> 501,401
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 36)
  ; 501,401 -> 363,56
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 38)
  ; 363,56 -> 501,401
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 38)
  ; 501,401 -> 957,338
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 46)
  ; 957,338 -> 501,401
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 46)
  ; 300,777 -> 501,401
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 43)
  ; 501,401 -> 300,777
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 43)
  ; 2484,175 -> 2174,492
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 45)
  ; 2174,492 -> 2484,175
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 45)
  ; 2326,641 -> 2174,492
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 22)
  ; 2174,492 -> 2326,641
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 22)
  ; 2326,641 -> 2484,175
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 50)
  ; 2484,175 -> 2326,641
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 50)
  ; 2175,755 -> 2174,492
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 27)
  ; 2174,492 -> 2175,755
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 27)
  ; 2175,755 -> 2326,641
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 19)
  ; 2326,641 -> 2175,755
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 19)
  ; 2518,900 -> 2326,641
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 33)
  ; 2326,641 -> 2518,900
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 33)
  ; 2518,900 -> 2175,755
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 38)
  ; 2175,755 -> 2518,900
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 38)
  ; 1066,2366 -> 1497,2287
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 44)
  ; 1497,2287 -> 1066,2366
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 44)
  ; 1262,2781 -> 1023,2894
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 27)
  ; 1023,2894 -> 1262,2781
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 27)
  ; 1262,2781 -> 1066,2366
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 46)
  ; 1066,2366 -> 1262,2781
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 46)
  ; 1436,2869 -> 1023,2894
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 42)
  ; 1023,2894 -> 1436,2869
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 42)
  ; 1436,2869 -> 1262,2781
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 20)
  ; 1262,2781 -> 1436,2869
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 20)
  ; 957,338 <-> 2174,492
  (road city-1-loc-3 city-2-loc-1)
  (= (road-length city-1-loc-3 city-2-loc-1) 123)
  (road city-2-loc-1 city-1-loc-3)
  (= (road-length city-2-loc-1 city-1-loc-3) 123)
  (road city-1-loc-3 city-3-loc-2)
  (= (road-length city-1-loc-3 city-3-loc-2) 154)
  (road city-3-loc-2 city-1-loc-3)
  (= (road-length city-3-loc-2 city-1-loc-3) 154)
  (road city-2-loc-3 city-3-loc-1)
  (= (road-length city-2-loc-3 city-3-loc-1) 123)
  (road city-3-loc-1 city-2-loc-3)
  (= (road-length city-3-loc-1 city-2-loc-3) 123)
  (at package-1 city-3-loc-5)
  (at package-2 city-2-loc-5)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-4)
  (at package-5 city-1-loc-2)
  (at truck-1 city-1-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-3-loc-4)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-2)
  (at package-2 city-2-loc-1)
  (at package-3 city-1-loc-5)
  (at package-4 city-3-loc-3)
  (at package-5 city-3-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-3-loc-4 city-3-loc-5)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-5)
   goals met: 0 of 5
2. (pick-up truck-2 city-3-loc-5 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-3-loc-5) (capacity truck-2 capacity-4)
   added: (in package-1 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 5
3. (drive truck-2 city-3-loc-5 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-5)
   added: (at truck-2 city-3-loc-2)
   goals met: 0 of 5
4. (drive truck-2 city-3-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 5
5. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 5
6. (pick-up truck-2 city-1-loc-4 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-4) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 5
7. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 5
8. (pick-up truck-2 city-1-loc-2 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-1-loc-2) (capacity truck-2 capacity-2)
   added: (in package-5 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
9. (pick-up truck-2 city-1-loc-2 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-2) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
10. (drop truck-2 city-1-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-1-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 5
11. (drive truck-2 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 1 of 5
12. (drive truck-2 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-5)
   goals met: 1 of 5
13. (drop truck-2 city-1-loc-5 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-1-loc-5) (capacity truck-2 capacity-2)
   goals met: 2 of 5
14. (drive truck-2 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 5
15. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 2 of 5
16. (drive truck-2 city-1-loc-3 city-3-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-3-loc-2)
   goals met: 2 of 5
17. (drive truck-2 city-3-loc-2 city-3-loc-5)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-5)
   goals met: 2 of 5
18. (drive truck-1 city-1-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 5
19. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 2 of 5
20. (drive truck-1 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-5)
   goals met: 2 of 5
21. (drop truck-2 city-3-loc-5 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-2)
   added: (at package-5 city-3-loc-5) (capacity truck-2 capacity-3)
   goals met: 3 of 5
22. (drive truck-2 city-3-loc-5 city-3-loc-4)
   deleted: (at truck-2 city-3-loc-5)
   added: (at truck-2 city-3-loc-4)
   goals met: 3 of 5
23. (drive truck-2 city-3-loc-4 city-3-loc-3)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-3)
   goals met: 3 of 5
24. (drop truck-2 city-3-loc-3 package-4 capacity-3 capacity-4)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-3)
   added: (at package-4 city-3-loc-3) (capacity truck-2 capacity-4)
   goals met: 4 of 5
25. (pick-up truck-1 city-2-loc-5 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-2-loc-5) (capacity truck-1 capacity-4)
   added: (in package-2 truck-1) (capacity truck-1 capacity-3)
   goals met: 4 of 5
26. (drive truck-1 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 4 of 5
27. (drive truck-1 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 4 of 5
28. (drop truck-1 city-2-loc-1 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-2-loc-1) (capacity truck-1 capacity-4)
   goals met: 5 of 5
